

&НаКлиенте
Асинх Процедура ЗагрузитьТест(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр = "Сценарии(*.feature)|*.feature";

	ИмяФайла = Ждать ДиалогВыбораФайла.ВыбратьАсинх();	
	
	Если НЕ ИмяФайла = Неопределено Тогда
	
		Данные = Новый ЧтениеТекста(ИмяФайла[0]);
		Объект.Сценарий = Данные.Прочитать();
	    Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Запустить(Команда)
	
	Данные = ПолучитьДвоичныеДанныеИзСтроки(Объект.ФайлТеста);
	
	ПутьКФичаФайлу = "C:\Users\Daniel\Documents\ВременнаяПапкаСТестом\" + Объект.Наименование + ".feature";
	
	Данные.Записать(ПутьКФичаФайлу);
	
	Ванесса = ПолучитьФорму("Обработка.VanessaAutomationsingle.Форма.УправляемаяФорма");
	
	Ванесса.УстановитьФичаФайл(ПутьКФичаФайлу);

    СтруктураНастроек = Новый Структура;
    СтруктураНастроек.Вставить("ИспользоватьКомпонентуVanessaExt", Ложь);
	СтруктураНастроек.Вставить("ДелатьЛогВыполненияСценариевВЖР", Истина);
    Ванесса.УстановитьНастройкиПриЗапускеБезОткрытияФормы(СтруктураНастроек);

    Ванесса.ВыполнитьСценарииБезОткрытияФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОкончаниеВыполненияСценариевVanessaAutomation" Тогда
	
		Сообщить("Ы");	
	
	КонецЕсли;
КонецПроцедуры

