
&НаКлиенте
Асинх Процедура РешениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Файл конфигурации(*.cf)|*.cf";
	ПутьКФайлу = Ждать Диалог.ВыбратьАсинх();
	
	Если Не ПутьКФайлу = Неопределено Тогда
	
		Решение = ПутьКФайлу[0];	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Загрузить(Команда)
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,Решение);
	Если Не ОписаниеФайла = Неопределено Тогда
		
		Идентификатор = Новый УникальныйИдентификатор;
		ОбработатьРешениеНаСервере(Задача, ОписаниеФайла.Адрес, Идентификатор);	
	    Решение = "";
		Элементы.РезультатыПроверки.Обновить();
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОбработатьРешениеНаСервере(Задача, Адрес, Идентификатор)
	
	ПутьКФайлу = Константы.КаталогХраненияРешений.Получить() + Идентификатор + ".cf";
	
	
	
	НачатьТранзакцию();
	Попытка
		
		Файл = ПолучитьИзВременногоХранилища(Адрес);
		Файл.Записать(ПутьКФайлу);  
		
		ЗаписьРегистраСоответствий = РегистрыСведений.СоответствиеИдентификаторовРешенийИПутейКФайлам.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСоответствий.Идентификатор = Идентификатор;
		ЗаписьРегистраСоответствий.ПутьКФайлу = ПутьКФайлу;
		ЗаписьРегистраСоответствий.Записать();	
		
		ЗаписьОчереди = РегистрыСведений.ОчередьЗадач.СоздатьМенеджерЗаписи();
		ЗаписьОчереди.Задача = Задача;
		ЗаписьОчереди.Идентификатор = Идентификатор;
		ЗаписьОчереди.Период = ТекущаяДата();
		ЗаписьОчереди.Статус = Перечисления.СтатусыВыполненияЗадач.КОбработке; 
		//todo: заменить на текущегопользователя системы
		ЗаписьОчереди.Пользователь = Справочники.Пользователи.НайтиПоНаименованию("Тестовый");
		ЗаписьОчереди.Записать();
        ЗафиксироватьТранзакцию();
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
	
	
	                         
КонецПроцедуры // ()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//todo: заменить на текущегопользователя системы
	РезультатыПроверки.Параметры.УстановитьЗначениеПараметра("Пользователь", Справочники.Пользователи.НайтиПоНаименованию("Тестовый"));
	РезультатыПроверки.Параметры.УстановитьЗначениеПараметра("Задача", Задача);


КонецПроцедуры


&НаКлиенте
Процедура ЗадачаПриИзменении(Элемент)
	РезультатыПроверки.Параметры.УстановитьЗначениеПараметра("Задача", Задача);
	Элементы.РезультатыПроверки.Обновить();
КонецПроцедуры

